import numpy as np

"""브로드캐스팅
열의 개수가 같으면 된다."""

x = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])
v = np.array([0, 2, 1])

# np.ones(x.shape)

y = x + v
# result
# array([[ 2,  2,  4],
#        [ 5,  5,  7],
#        [ 8,  8, 10],
#        [11, 11, 13]])

w = np.array([[0, 2, 1, 4]])

x + w.T
# result
# array([[ 1,  2,  3],
#        [ 6,  7,  8],
#        [ 8,  9, 10],
#        [14, 15, 16]])

#####################################################
# 위 코드를 브로드 캐스팅까지 풀어본다면
""" tile 사용 """

x = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])
v = np.array([1, 0, 1])

vv = np.tile(v, (4, 1))
np.add(x, v)
# or
x + vv
# result
# array([[ 2,  2,  4],
#        [ 5,  5,  7],
#        [ 8,  8, 10],
#        [11, 11, 13]])


"""for 문 사용"""
x = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])
v = np.array([1, 0, 1])

y = np.empty_like(x)

for i in range(4):
    """x의 0번째 행부터 가져와서 v를 더한 값을
    y에 저장"""
    y[i, :] = x[i, :] + v

y
# result
# [[ 2  2  4]
#  [ 5  5  7]
#  [ 8  8 10]
#  [11 11 13]]

A = np.array([[1, 2], [3, 4], [5, 6]])
A.shape
# (3, 2)


B = np.array([7, 8])
B.shape
# (2,)


result = np.dot(A, B)
print(result)
# [23 53 83]


